## How do I remove columns from a pandas DataFrame?

In [1]:
import pandas as pd

In [2]:
#read dataset ufo
ufo_path = 'http://bit.ly/uforeports'
ufo = pd.read_csv(ufo_path)

In [3]:
ufo.shape

(18241, 5)

### Drop Cols

In [4]:
#IMPORTANT: PANDAS
#drop #cols #remove #prepare #pandas

#new: drop cols by specifying cols
ufo.drop(columns=['City','State']).head()

#old way to drop columns: specify labels and axis
#ufo.drop(['City','State'],axis=1).head()
#ufo.drop(['City','State'],axis='columns').head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

In [5]:
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

### Drop Rows

In [6]:
#IMPORTANT: PANDAS
#drop #row #remove #prepare #pandas

#new: drop rows by specifying index
ufo.drop(index=[0,1]).head()

#old: drop rows by specifying labels and axis
#ufo.drop([0,1],axis=0,inplace=True)
#ufo.drop([0,1], axis='index').head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

In [7]:
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00